app/controllers/test_controller.rb

  def index
    @questions = Question.all
---
SELECT * FROM `questions`

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def show_answer
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 3)

  def edit_question
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def update_question
    q=Question.find(params[:question_id])
    q.update_attribute(:title, params[:question][:title])

    q.answers.each_with_index do |a,i|
      a.update_attribute(:title, params["answer#{i}"])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
UPDATE `questions` SET `updated_at` = '2010-01-30 16:55:38', `title` = 'mi pregunta123' WHERE `id` = 1
UPDATE `answers` SET `updated_at` = '2010-01-30 18:47:48', `title` = NULL WHERE `id` = 1

  def create
    q=Question.new(params[:question])
    q.answers  << Answer.new(:title => params[:answer1], :correct => params[:correct1])
    q.answers  << Answer.new(:title => params[:answer2], :correct => params[:correct2])
    q.answers  << Answer.new(:title => params[:answer3], :correct => params[:correct3])
    q.answers  << Answer.new(:title => params[:answer4], :correct => params[:correct4])
    q.comments << Comment.new(:title => params[:comment])
---
INSERT INTO `answers` (`question_id`, `correct`, `created_at`, `title`, `updated_at`) VALUES(5, NULL, '2010-01-29 15:39:49', 'r1', '2010-01-29 15:39:49')
INSERT INTO `questions` (`created_at`, `title`, `updated_at`) VALUES('2010-01-29 15:37:08', 'e', '2010-01-29 15:37:08')
INSERT INTO `comments` (`question_id`, `created_at`, `title`, `updated_at`) VALUES(3, '2010-01-30 20:14:23', 'No tiene porque almacenar la trama al completo. Puede ponerse a retrasmitir en cuanto disponga de la cabecera (cut-through)', '2010-01-30 20:14:23')

  def correct
    @question_answered = Question.find(params[:question])
    @question = @question_answered.next
    @marked_answer = Answer.find(params[:answer]) if params[:answer]
---
SELECT `questions`.id FROM `questions` WHERE (`questions`.`id` = 2) LIMIT 1
SELECT * FROM `answers` WHERE (`answers`.question_id = 16)

  def add_comment
    qu=Question.find(params[:question_answered_id])
    qu.comments << Comment.new(params[:comment])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 2)
INSERT INTO `comments` (`question_id`, `created_at`, `title`, `updated_at`) VALUES(2, '2010-01-30 19:43:27', ' Ambas son posibles. \r\n El IEEE cogio el formato de etehrnet DIX y lo modificó ligeramente, convirtiendo el campo \"tipo\" en \"longitud\" .\r\n Ethernet DIX ya estaba en uso para entonces y la gente pasó del IEEE. En el 97 el IEEE se rindió y dijo q las dos formas\r\nvalian. Como por entonces todos los campos TIPO en uso eran mayores que 1500 se estableció que si el valor de dicho campo\r\nera menor a 1500 significaría \"longitud\" y \"tipo\" en caso contrario\r\n	Sin embargo si el( uso de IEEE 802.3 va siempre acompañado del 802.2 (LLC) es seguro que en este nivel se identifica el\r\nprotocolo superior (SAP destino), esto es el protocolo de nivel 3. De todas manerasla esta respuesta da a entender q se usan ambos campos, cuando en verdad solo es necesario uno.\r\n', '2010-01-30 19:43:27')

  def search
    escaped_query =  params[:query].gsub('%', '\%').gsub('_', '\_')
    questions = Question.find(:all, :conditions => ["title LIKE ?", "%#{escaped_query}%"])
    answers = Answer.find(:all, :conditions => ["title LIKE ?", "%#{escaped_query}%"]).map(&:question)
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 5)
SELECT * FROM `answers` WHERE (`answers`.question_id = 4)